
def area(a, h): 
    '''
    Возвращает площадь треугольника с основанием a и высотой h к этому основанию
        area(a, h)
    Параметры
        a (int): сторона треугольника
        h (int): высота треугольника
    '''
    return a * h / 2 


def perimeter(a, b, c): 
    '''
    Возвращает периметр треугольника со сторонами a, b, c
        perimeter(a, b, c)
    Параметры
        a (int): сторона треугольника
        b (int): сторона треугольника
        c (int): сторона треугольника
    '''
    return a + b + c 