
def area(a, h): 
    '''
    Возвращает площадь треугольника с основанием a и высотой h к этому основанию
        area(a, h)
    Параметры
        a (int): сторона прямоугольника
        h (int): высота треугольника
    '''
    return a * h / 2 


def perimeter(a, b, c): 
    '''
    Возвращает периметр треугольника с основанием a и высотой h к этому основанию
        perimeter(a, h)
    Параметры
        a (int): сторона прямоугольника
        h (int): высота треугольника
    '''
    return a + b + c 